Repository: novaway/BehatCommonContext
Catalog: i18n/*.xliff
Languages: fr

# i-fill-in-select2-input-with-and-select
source: /^(?:|I )fill in select2 input "(?P<field>(?:[^"]|\\")*)" with "(?P<value>(?:[^"]|\\")*)" and select "(?P<entry>(?:[^"]|\\")*)"$/
fr: /^(?:|je )remplis le champs select2 "(?P<field>(?:[^"]|\\")*)" avec "(?P<value>(?:[^"]|\\")*)" et sélectionne "(?P<entry>(?:[^"]|\\")*)"$/

# i-fill-in-select2-input-with
source: /^(?:|I )fill in select2 input "(?P<field>(?:[^"]|\\")*)" with "(?P<value>(?:[^"]|\\")*)"$/
fr: /^(?:|je )remplis le champs de recherche select2 "(?P<field>(?:[^"]|\\")*)" avec "(?P<value>(?:[^"]|\\")*)"$/

# i-fill-in-select2-input-with-and-select-and-wait
source: /^(?:|I )fill in select2 "(?P<field>(?:[^"]|\\")*)" with "(?P<value>(?:[^"]|\\")*)" and wait (?P<time>(?:[^"]|\\")*) seconds until results are loaded$/
fr: /^(?:|je )remplis le champs select2 "(?P<field>(?:[^"]|\\")*)" avec "(?P<value>(?:[^"]|\\")*)" et (?:|j')attends (?P<time>(?:[^"]|\\")*) secondes le chargement des résultats$/

# i-fill-in-select2-input-with-and-wait
source: /^(?:|I )fill in select2 "(?P<value>(?:[^"]|\\")*)" for "(?P<field>(?:[^"]|\\")*)" and wait (?P<time>(?:[^"]|\\")*) seconds until results are loaded$/
fr: /^(?:|je )remplis le champs select2 "(?P<value>(?:[^"]|\\")*)" pour "(?P<field>(?:[^"]|\\")*)" et (?:|j')attends (?P<time>(?:[^"]|\\")*) secondes le chargement des résultats$/

# i-fill-in-select2-field-with
source: /^(?:|I )fill in select2 "(?P<field>(?:[^"]|\\")*)" with "(?P<value>(?:[^"]|\\")*)"$/
fr: /^(?:|je )remplis le champs select2 "(?P<field>(?:[^"]|\\")*)" avec "(?P<value>(?:[^"]|\\")*)"$/

# i-fill-in-select2-field-for
source: /^(?:|I )fill in select2 "(?P<value>(?:[^"]|\\")*)" for "(?P<field>(?:[^"]|\\")*)"$/
fr: /^(?:|je )remplis le champs select2 "(?P<value>(?:[^"]|\\")*)" pour "(?P<field>(?:[^"]|\\")*)"$/

# i-should-see-select-choices
source: /^(?:|I )should see (?P<num>\d+) choice(?:|s) in select2 "(?P<field>(?:[^"]|\\")*)"$/
fr: /^(?:|je )devrais voir (?P<num>\d+) éléments dans le champs select2 "(?P<field>(?:[^"]|\\")*)"$/

# i-fill-in-field-without-loosing-focus-with
source: /^(?:|I )fill in "(?P<field>(?:[^"]|\\")*)" with "(?P<value>(?:[^"]|\\")*)" without loosing focus$/
fr: /^(?:|je )remplis "(?P<field>(?:[^"]|\\")*)" avec "(?P<value>(?:[^"]|\\")*)" sans perdre le focus$/

# i-fill-in-field-without-loosing-focus-for
source: /^(?:|I )fill in "(?P<value>(?:[^"]|\\")*)" for "(?P<field>(?:[^"]|\\")*)" without loosing focus$/
fr: /^(?:|je )remplis "(?P<value>(?:[^"]|\\")*)" pour "(?P<field>(?:[^"]|\\")*)" sans perdre le focus$/

# i-fill-in-selecter-field-with
source: /^(?:|I )fill in selecter "(?P<field>(?:[^"]|\\")*)" with "(?P<value>(?:[^"]|\\")*)"$/
fr: /^(?:|je )remplis le champs selecter "(?P<field>(?:[^"]|\\")*)" avec "(?P<value>(?:[^"]|\\")*)"$/

# i-fill-in-selecter-field-for
source: /^(?:|I )fill in selecter "(?P<value>(?:[^"]|\\")*)" for "(?P<field>(?:[^"]|\\")*)"$/
fr: /^(?:|je )remplis le champs selecter "(?P<value>(?:[^"]|\\")*)" pour "(?P<field>(?:[^"]|\\")*)"$/

# i-fill-in-dropdown-field-with
source: /^(?:|I )fill in dropdown "(?P<field>(?:[^"]|\\")*)" with "(?P<value>(?:[^"]|\\")*)"$/
fr: /^(?:|je )remplis le champs dropdown "(?P<field>(?:[^"]|\\")*)" avec "(?P<value>(?:[^"]|\\")*)"$/

# i-fill-in-dropdown-field-for
source: /^(?:|I )fill in dropdown "(?P<value>(?:[^"]|\\")*)" for "(?P<field>(?:[^"]|\\")*)"$/
fr: /^(?:|je )remplis le champs dropdown "(?P<value>(?:[^"]|\\")*)" pour "(?P<field>(?:[^"]|\\")*)"$/
